app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Title 2"], ["description", "Test post 2"], ["created_at", "2019-03-07 16:26:24.127108"], ["updated_at", "2019-03-07 16:26:24.127108"]]
---
	def create
		#binding.pry
	  @post = Post.new(params[:post])
	  @post.save